#算术运算符：数学运算中的符号
# a=10
# b=3
# print(a/b)  #除法
# print(a//b) #除法,只保留整数部分
# print(a%b)  #获取余数
# print(a**b) #获取幂次方


#赋值运算符：给变量赋值
# a=125
# b=a+1
# a+=5 #在a的基础上再加5  --- a=a+5
# print(a)


#关系运算符：比较两个变量之间关系
#> <  ==  >=  <=  !=
#关系运算符运算的结果是布尔值
a=5
b=6
# print(a>b)
# print(a<b)
# print(a==5)
# print(a>=b)
# print(a!=b)

#判断字符串是否相等（不相等）
c="hello"
d="你好"
# print(c==d)
# print(c!=d)



#逻辑运算符：判断表达式之间的逻辑关系
# and or  not
print(5>3 and 6<3) #左右的布尔表达式都为真，整个表达式为真
print(5>3 or 6<3) #左右的布尔表达式只要有一个为真，整个表达式为真
print(not 6>3) #对右边布尔表达式取反

