#列表 list
#特性：有序；元素可以重复；可以存放多种数据类型
lista=["张三","李四","王五","赵六",666]
#        0      1      2     3     4
#       -5     -4     -3    -2    -1      

# #通过索引（下标）获取值
# print(lista[2])
# print(lista[-3])


#切片
listb=[1,21,3232,32,435,67,687,8,7232,3,546,575,888,7]
#      0  1  2   3   4   5  6  7   8  9  10  11  12 13

#print(listb[1:11:2])  #listb[起始索引:结束索引:步长]
# print(listb[8:])  #获取某个索引以后的所有值
#print(listb[:8])    #获取某个索引以前的所有值


# #增加数据
# lista=["张三","李四","王五","赵六"]
# lista.append("大宝") #在末尾添加元素
# lista.insert(2,"乔峰") #在指定位置添加元素


# #删除数据
# lista=["张三","李四","王五","赵六"]
# lista.remove("王五") #删除一个具体值
# lista.pop(2)  #删除元指定位置的值


#给元素重新赋值
lista=["张三","李四","王五","赵六"]
lista[0]="张三丰"
print(lista)