import random  #引入随机数模块


#模块名.函数名()
r1=random.randint(1,6) #生成指范围随机整数
r2=random.uniform(1,6) #生成指范围随机浮点数
r3=random.choice([1,132,32,43,43,454,46,56,55,76,7]) #在一个序列中随机获取一个值
r4=random.random() #生成0-1随机浮点数


#抽奖程序：一等奖 笔记本电脑 0.001   二等奖 冰箱 0.01  三等奖 音响 0.05   谢谢惠顾 1-0.001-0.01-0.05
print("正在抽奖.......")
r=random.randint(1,1000)
print("----------您的抽奖号码是：",r)
if r==1:
	print("*******恭喜你，获得一等奖笔记本电脑！")
elif 10<=r<=19:
	print("*******恭喜你，获得二等奖 冰箱！")
elif 100<=r<=149:
	print("*******恭喜你，获得三等奖 音响！")
else:
	print("******* 谢谢惠顾！")